{
  
  "menu": {
    "home": "Inicio",
    "projects": "Proxectos",
    "about": "Sobre min",
    "contact": "Contacto"
  },
  "index_h1": "Ola! Son Zeltia! 🕹️",
  "index_h3": "desenvolvedora  &  deseñadora",
  "index_link_about": "Coñéceme",
  "index_or": "ou",
  "index_link_projects": "explora os meus proxectos",
  "projects_title": "Últimos proxectos",
  "headline": "Coñéceme un pouco máis!",
  "btn_about": "Sobre min",
  "btn_education": "Educación",
  "btn_work": "Experiencia laboral",
  "btn_skills": "Habilidades",
  "about_title": "Desenvolvedora Web Junior & Deseñadora de Galicia, España.☀️",
  "about_desc": "Ola! Son Zeltia! Estou en España e apasióname crear sitios web bonitos e funcionais. Gústame combinar a miña formación en Belas Artes co desenvolvemento web para ofrecer experiencias dixitais únicas. Sempre con ganas de aprender e medrar no mundo tech!",
  "edu_title1": "Técnico Superior en Desenvolvemento de Aplicacións Web",
  "edu_desc1": "IES San Andrés. 2024-Presente",
  "edu_title2": "Licenciatura en Belas Artes",
  "edu_desc2": "Universidade de Salamanca. 2020-2023",
  "work_title": "Prácticas",
  "work_desc": "IES San Andrés. Maio-Xuño 2025",
  "skills_hard": "Habilidades técnicas",
  "skills_hard_list": "Java, JavaScript, HTML, CSS, SQL, Linux, Administración IT",
  "skills_soft": "Habilidades brandas",
  "skills_soft_list": "Pensamento crítico e creativo, Traballo en equipo, Proactividade",
  "contact_text": "Contacta comigo a través de redes sociais ou mándame un correo! 📨",
  "form_send": "Enviar",

  "portfolioSection": {
    "title": "Portfolio",
    "desc": "Este sitio é o meu proxecto persoal favorito e máis completo. Construino usando HTML, CSS e JavaScript, co obxectivo de amosar non só as miñas habilidades técnicas como desenvolvedora, senón tamén a miña formación en deseño e artes. Inicialmente comecei cunha paleta cálida baseada en vermellos, pero despois cambiou a unha base máis limpa en branco e negro con sutís toques vermellos, buscando un aspecto máis profesional pero persoal. Estou especialmente orgullosa dalgúns aspectos técnicos: integrei EmailJS para manexar formularios de contacto de forma máis fluída que un mailto básico, e reestruturei o sitio de múltiples páxinas HTML a un deseño dunha soa páxina con navegación suave por scroll. Tamén desenvolvin un carrusel interactivo que enlaza a unha sección dedicada a proxectos, onde cada un se detalla nunha área desprazable. Todo está deseñado para ofrecer unha experiencia clara, accesible e visualmente coidada.",
    "repo": "Repositorio",
    "visit": "Visitar"
  },

  "mapsSection": {
    "title": "Maps",
    "desc": "Maps é unha app web interactiva onde os usuarios poden buscar cidades predeterminadas ou engadir as súas propias direccións, categorizando cada ubicación cun marcador codificado por cores segundo o tipo: puntos de interese, históricos, relixiosos ou culturais. A app inclúe unha lexenda cos cores e un botón para mostrar datos de terremotos dun feed XML para España. Construída con JavaScript, HTML, CSS, OpenStreetMap e a API Leaflet, foi o meu primeiro proxecto con APIs, o que supuxo unha experiencia moi enriquecedora. Desenvolvida nun equipo de tres persoas en catro sesións de seis horas, centramosnos en crear unha interface limpa e intuitiva, usando unha paleta de tons grises que complementa o mapa para un deseño cohesivo e fácil de usar.",
    "repo": "Repositorio",
    "visit": "Visitar"
  },

  "redesSection": {
    "title": "CalcuRedes",
    "desc": "CalcuRedes é unha calculadora de redes deseñada para calcular datos clave dunha IP, como máscaras de subrede, wildcards, enderezos broadcast e detalles de subredes. Aínda que o proxecto tivo algúns retos técnicos e limitacións de tempo, foi unha experiencia de aprendizaxe valiosa. Construído con HTML, CSS e JavaScript, esta ferramenta axudoume a min e aos meus compañeiros a profundar en conceptos de redes. A interface ten un deseño limpo en tons azuis e brancos, complementado con tipografía estilo pixel para darlle un toque retro-tecnolóxico.",
    "repo": "Repositorio",
    "visit": "Visitar"
  },

  "memoriumSection": {
    "title": "Memorium",
    "desc": "Memorium foi o meu primeiro proxecto como becaria no IES San Andrés, onde desenvolvemos un xogo de memoria en grupo durante dúas semanas. Ningún de nós tiña experiencia previa con JavaScript, así que o proxecto implicou moita investigación e seguir numerosos tutoriais para aprender sobre a marcha. O xogo presenta un estilo visual gótico e Souls-like, con varios taboleiros e modos de xogo para manter aos xogadores enganchados. Un divertido easter egg actívase se o nome de usuario é \"snake\": en lugar do xogo de memoria, aparece o clásico xogo da serpe. Isto é un guiño á nosa baralla de cartas temática de Metal Gear, que inclúe personaxes chamados Snake. A pesar dos retos de aprender JavaScript por primeira vez, estou orgullosa do progreso e as habilidades técnicas que desenvolvin neste proxecto intenso e gratificante.",
    "repo": "Repositorio",
    "visit": "Visitar"
  }
}
